Tekla Open API Reference for Tekla Structures 2025
Operation.SetHandlePoints Method
 Set the Shape Item Handle Points
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetHandlePoints(
	string guid,
	List<Point> HandlePoints
)
Public Shared Function SetHandlePoints (
	guid As String,
	HandlePoints As List(Of Point)
) As Boolean
Parameters
guid
Type: System.String
The guid of the shape
HandlePoints
Type: System.Collections.Generic.List<Point>
An array of handle points
Return Value
Type: Boolean
True if the appending operation was successful
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace